In [20]:
import pandas as pd

In [24]:
dictionary = {'Nome' : ['Juliana Chagas', 'Pedro Lopes', 'Francisco Vena'],
            'Idade' : [20, 15, 8],
            'Estudo' : ['Superior', 'Ensino Médio', 'Ensino Fundamental']}

In [25]:
df = pd.DataFrame(dictionary)

In [26]:
df

             Nome  Idade              Estudo
0  Juliana Chagas     20            Superior
1     Pedro Lopes     15        Ensino Médio
2  Francisco Vena      8  Ensino Fundamental

In [28]:
# Adicionando nova linha
nova_linha = pd.DataFrame([{'Nome': 'Clara rodrigues', 'Idade': 45, 'Estudo': 'Ensino Medio'}])
df = pd.concat([df, nova_linha], ignore_index=True)

In [29]:
df

              Nome  Idade              Estudo
0   Juliana Chagas     20            Superior
1      Pedro Lopes     15        Ensino Médio
2   Francisco Vena      8  Ensino Fundamental
3  Clara rodrigues     45        Ensino Medio